Config/InformationRegisters/РеестрКлючейПростыхЭлектронныхПодписей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РеестрКлючейПростыхЭлектронныхПодписей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтзыва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/РеестрКлючейПростыхЭлектронныхПодписей/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЗаписьРегистра Из ЭтотОбъект Цикл
		
		Если ЗначениеЗаполнено(ЗаписьРегистра.ДатаОтзыва)
			И ЗаписьРегистра.ДатаОтзыва <= ЗаписьРегистра.Период Тогда
			ТекстОшибки = НСтр("ru='Дата отзыва ключа должна быть больше даты выдачи'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеестрКлючейПростыхЭлектронныхПодписей.Период КАК ДатаВыдачи,
		|	РеестрКлючейПростыхЭлектронныхПодписей.ДатаОтзыва КАК ДатаОтзыва
		|ИЗ
		|	РегистрСведений.РеестрКлючейПростыхЭлектронныхПодписей КАК РеестрКлючейПростыхЭлектронныхПодписей
		|ГДЕ
		|	РеестрКлючейПростыхЭлектронныхПодписей.Организация = &Организация
		|	И РеестрКлючейПростыхЭлектронныхПодписей.Пользователь = &Пользователь
		|	И (РеестрКлючейПростыхЭлектронныхПодписей.Период > &НоваяДатаВыдачи
		|				И (&НоваяДатаОтзыва = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ &НоваяДатаОтзыва >= РеестрКлючейПростыхЭлектронныхПодписей.Период)
		|			ИЛИ РеестрКлючейПростыхЭлектронныхПодписей.Период < &НоваяДатаВыдачи
		|				И (РеестрКлючейПростыхЭлектронныхПодписей.ДатаОтзыва = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ РеестрКлючейПростыхЭлектронныхПодписей.ДатаОтзыва >= &НоваяДатаВыдачи))";
		
		Запрос.УстановитьПараметр("Организация", ЗаписьРегистра.Организация);
		Запрос.УстановитьПараметр("Пользователь", ЗаписьРегистра.Пользователь);
		Запрос.УстановитьПараметр("НоваяДатаВыдачи", ЗаписьРегистра.Период);
		Запрос.УстановитьПараметр("НоваяДатаОтзыва", ЗаписьРегистра.ДатаОтзыва);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			ТекстОшибки = НСтр("ru='У пользователя уже есть активный ключ ПЭП в данном периоде'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
